In [1]:
# Importing Liabraries
import pandas as pd
import numpy as np
import os

In [2]:
# Assigning path
path = path=r'C:\Users\ANGEL\Desktop\Instacart Master Analysis'

In [3]:
path

'C:\\Users\\ANGEL\\Desktop\\Instacart Master Analysis'

In [4]:
# Importing Customers Data 
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [5]:
df_cust.head(5)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_cust.shape

(206209, 10)

# 01 Data Wrangling

### STEP 1 : Dropping Columns

For our analysis, we do not need the names columns so we can drop them

In [7]:
df_cust = df_cust.drop(columns = ['First Name', 'Surnam'])

In [8]:
#Checking for Step 1
df_cust.head(5)

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

### STEP 2 : Renaming Columns

In [9]:
df_cust.rename(columns = {'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'dependents', 'fam_status' : 'family_status'}, inplace = True)

In [10]:
# Checking Step 2
df_cust.head(5)

,user_id,gender,state,age,date_joined,dependents,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

### STEP 3 : Changing Data Type

In [11]:
df_cust.describe()

             user_id            age     dependents         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [12]:
# Changing the data type of User_id to string, as we do not need thus in our analysis
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [13]:
df_cust['user_id'].dtype

dtype('O')

# 02 Consistency Checks

### STEP 1 : Finding Mixed Type Data

In [14]:
for col in df_cust.columns.tolist():
    weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_cust[weird]) > 0:
        print(col)

#### There are no mixed data types in the dataframe

### STEP 2: Finding Missing Values

In [15]:
df_cust.isnull().sum()

user_id          0
gender           0
state            0
age              0
date_joined      0
dependents       0
family_status    0
income           0
dtype: int64

#### There are no missing values in the dataframe

### STEP 3: Finding Duplicate Values

In [16]:
df_cust[df_cust.duplicated()]

Empty DataFrame
Columns: [user_id, gender, state, age, date_joined, dependents, family_status, income]
Index: []

#### There are no duplicates in this dataframe.

In [17]:
# Customer data after consistency checks
df_cust.shape

(206209, 8)

# 03 Merging Data

In [18]:
# Importing the updated Orders_Products_merged Data from Prepared Data

df_ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_updated_2.pkl'))

In [19]:
df_ords_prods_merge.head(5)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,median_order_frequency,order_frequency_flag
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,Mid-range product,Regularly busy,Regularly busy days,Average orders,10,New customer,14.0,High Spender,20.5,Non-frequent customer
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,Mid-range product,Regularly busy,Least busy days,Average orders,10,New customer,14.0,High Spender,20.5,Non-frequent customer
2,473747,1,prior,3,3,12,21.0,196,1,1,...,Mid-range product,Regularly busy,Least busy days,Most orders,10,New customer,14.0,High Spender,20.5,Non-frequent customer
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,Mid-range product,Least busy,Least busy days,Average orders,10,New customer,14.0,High Spender,20.5,Non-frequent customer
4,431534,1,prior,5,4,15,28.0,196,1,1,...,Mid-range product,Least busy,Least busy days,Most orders,10,New customer,14.0,High Spender,20.5,Non-frequent customer

In [20]:
df_ords_prods_merge['user_id'].dtype

dtype('int64')

In [21]:
# Changing the data type of User_id to string, as we do not need thus in our analysis
df_ords_prods_merge['user_id'] = df_ords_prods_merge['user_id'].astype('str')

In [22]:
# Using outer join to merge both dataframes so that we do not loose any data
df_ords_prods_cust = pd.merge(df_ords_prods_merge, df_cust, on = 'user_id', how = 'outer')

In [23]:
# Checking the Output
df_ords_prods_cust.head(5)

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,spending_flag,median_order_frequency,order_frequency_flag,gender,state,age,date_joined,dependents,family_status,income
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,High Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,prior,2,3,7,15.0,196,1,1,...,High Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,prior,3,3,12,21.0,196,1,1,...,High Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,prior,4,4,7,29.0,196,1,1,...,High Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,prior,5,4,15,28.0,196,1,1,...,High Spender,20.5,Non-frequent customer,Female,Alabama,31,2/17/2019,3,married,40423

In [24]:
df_ords_prods_cust.shape

(32404859, 32)

In [25]:
df_ords_prods_cust['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [26]:
#Exporting data as pickle
df_ords_prods_cust.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_all.pkl'))